import './Commands.scss'

export const Commands = () => {
  return (
    <section>
      <div className="section-outer commands">
        <div className="section-inner commands-content">
          <table className="styles_commands__table__4-iv0">
            <thead>
              <tr>
                <th>Команда</th>
                <th>Опис</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td>/spawn</td>
                <td>Телепортація на спавн</td>
              </tr>
              <tr>
                <td>/home</td>
                <td>Телепортує на точку відродження</td>
              </tr>
              <tr>
                <td>/tpa (нік)</td>
                <td>Запит, на телепортацію до іншого гравця</td>
              </tr>
              <tr>
                <td>/tpaccept</td>
                <td>
                  Команда, що підтверджує запит, на телепортацію до вас іншого
                  гравця
                </td>
              </tr>
              <tr>
                <td>/tpacancel</td>
                <td>Відміняє запит, на телепортацію до іншого гравця</td>
              </tr>
              <tr>
                <td>/warp (назва)</td>
                <td>Телепортує на точку варпу</td>
              </tr>
              <tr>
                <td>/rtp</td>
                <td>
                  Телепортує у випадкову точку на поверхні по основному світу
                </td>
              </tr>
              <tr>
                <td>/getpos</td>
                <td>Дізнатися свої координати</td>
              </tr>

              <tr>
                <td>/ignore (нік)</td>
                <td>
                  Дозволяє перестати отримувати повідомлення від іншого гравця
                </td>
              </tr>
              <tr>
                <td>/kit (назва)</td>
                <td>Отримати обраний за назвою набір предметів</td>
              </tr>
              <tr>
                <td>/kit list</td>
                <td>Виводить у чаті список доступних наборів</td>
              </tr>
              <tr>
                <td>/warp list</td>
                <td>Виводить у чат список доступних варпів</td>
              </tr>
              <tr>
                <td>/msg (нік)</td>
                <td>Написати приватне повідомлення іншому гравцю</td>
              </tr>
              <tr>
                <td>/r</td>
                <td>
                  Швидко відповісти на приватне повідомлення іншого гравця
                </td>
              </tr>
              <tr>
                <td>/suicide</td>
                <td>Померти у грі</td>
              </tr>
              <tr>
                <td>/near</td>
                <td>Дізнатися, хто з гравців поруч з вами</td>
              </tr>
              <tr>
                <td>/delhome</td>
                <td>Видаляє точку відродження</td>
              </tr>
              <tr>
                <td>//wand</td>
                <td>
                  Отримати дерев'яну сокиру - інструмент для створення
                  приватного регіону
                </td>
              </tr>
              <tr>
                <td>//expand</td>
                <td>Команда, для розширення виділеного регіону</td>
              </tr>
              <tr>
                <td>/rg claim (назва)</td>
                <td>
                  Створює регіон з виділеної області для вашого привату з вашою
                  назвою
                </td>
              </tr>
              <tr>
                <td>//pos1 //pos2</td>
                <td>Створює виділення першої та другої позицї гравця</td>
              </tr>
              <tr>
                <td>//size</td>
                <td>Виводить у чат розмір виділеного регіону</td>
              </tr>
              <tr>
                <td>//sel</td>
                <td>Прибрати виділений регіон</td>
              </tr>
              <tr>
                <td>/rg info</td>
                <td>Вивести інформацію про регіон</td>
              </tr>
              <tr>
                <td>//contract</td>
                <td>Команда, для зменшення виділеного регіону</td>
              </tr>
              <tr>
                <td>/rg redefine</td>
                <td>Перестворити регіон за новим виділенням</td>
              </tr>
              <tr>
                <td>/rg list</td>
                <td>Виводить список створених регіонів</td>
              </tr>
              <tr>
                <td>/addmember (нік)</td>
                <td>Надати доступ гравцю до свого привату</td>
              </tr>
              <tr>
                <td>//count</td>
                <td>Підрахувати кількість блоків у виділеному регіоні</td>
              </tr>
              <tr>
                <td>/rg remove (назва)</td>
                <td>Видалити регіон по назві</td>
              </tr>
              <tr>
                <td>/rg sel</td>
                <td>Виділити регіон, в якому ви знаходитесь</td>
              </tr>
              <tr>
                <td>/rg removemember (нік)</td>
                <td>Видаляє з регіона обраного гравця, доданого раніше</td>
              </tr>
              <tr>
                <td>/pvp</td>
                <td>Можливість вимикати і вмикати стан ПВП на сервері</td>
              </tr>
              <tr>
                <td>/enderchest</td>
                <td>Швидкий доступ до ендерскрині</td>
              </tr>

              <tr>
                <td>/feed</td>
                <td>Повністю відновлює шкалу голоду гравця</td>
              </tr>
              <tr>
                <td>/heal</td>
                <td>Повністю відновлює шкалу здоров'я гравця</td>
              </tr>
              <tr>
                <td>/repair</td>
                <td>Повністю ремонтує предмет, що в руках у гравця</td>
              </tr>
              <tr>
                <td>/workbench</td>
                <td>Відкриває уявний верстак</td>
              </tr>
              <tr>
                <td>/setwarp (назва)</td>
                <td>Встановлює точку варпу</td>
              </tr>
              <tr>
                <td>/sethome</td>
                <td>Встановлює точку відродження</td>
              </tr>

              <tr>
                <td>/back</td>
                <td>
                  Повернутися назад на точку смерті або до поперадньої точки
                  телепортації
                </td>
              </tr>
            </tbody>
          </table>
          <p className="commands-text">
            Певні команди доступні лише певним категоріям гравців
          </p>
        </div>
      </div>
    </section>
  )
}
