import './Agreement.scss'

export const Agreement = () => (
  <section>
    <div className="section-outer">
      <div className="section-inner">
        <div className="content agreement">
          <h3>Договір публічної оферти</h3>
          <b>1. Загальні положення</b>
          <br />
          1.1. Справжня оферта, є офіційною пропозицією «playcraft.com.ua», далі
          за текстом - «Продавець», укласти Договір купівлі-продажу товарів
          дистанційним способом, тобто через Інтернет-магазин, далі по тексту -
          «Договір», і розміщує Публічну оферту (пропозицію) на офіційному
          інтернет-сайті Продавця «https://playcraft.com.ua (далі -«
          Інтернет-сайт »).
          <br />
          1.2. Моментом повного і безумовного прийняття Покупцем пропозиції
          Продавця (акцептом) укласти електронний договір купівлі-продажу
          товарів, вважається факт оплати Покупцем замовлення на умовах цього
          Договору, у строки та за цінами, вказаними на Інтернет-сайті Продавця.
          <br />
          <b>2. Поняття і визначення</b>
          <br />
          2.1. У цій оферті, якщо контекст не вимагає іншого, наведені нижче
          терміни мають таке значення:
          <ul>
            <li>«Товар» - віртуальна валюта та послуги;</li>
            <li>
              «Інтернет-магазин» - відповідно до Закону України «про електронну
              комерцію», засіб для подання або реалізації товару, роботи або
              послуги шляхом здійснення електронної угоди;
            </li>
            <li>
              «Продавець» - компанія, яка реалізує товари, представлені на
              Інтернет-сайті;
            </li>
            <li>
              «Покупець» - фізична особа, що уклала з Продавцем Договір на
              умовах, викладених нижче;
            </li>
            <li>
              «Замовлення» - вибір окремих позицій з переліку товарів,
              зазначених Покупцем при розміщенні замовлення і проведенні оплати.
            </li>
          </ul>
          <b>3. Предмет договору</b>
          <br />
          3.1. Продавець зобов'язується передати у власність Покупця Товар, а
          Покупець зобов'язується оплатити і прийняти Товар на умовах даного
          Договору.
          <br />
          Цей Договір регулює купівлю-продаж товарів в Інтернет-магазині, в тому
          числі:
          <ul>
            <li>- добровільний вибір Покупцем товарів в Інтернет-магазині;</li>
            <li>
              - самостійне оформлення Покупцем замовлення в Інтернет-магазині;
            </li>
            <li>
              - оплата Покупцем замовлення, оформленого в Інтернет-магазині;
            </li>
            <li>
              - обробка і доставка замовлення Покупцеві у власність на умовах
              цього Договору.
            </li>
          </ul>
          <b>4. Порядок оформлення замовлення</b>
          <br />
          4.1. Покупець має право оформити замовлення на будь-який товар,
          представлений на Сайті Інтернет-магазину і наявний.
          <br />
          4.2. Кожна позиція може бути представлена ​​в замовленні в будь-якій
          кількості.
          <br />
          <b>5. Права та обов'язки сторін:</b>
          <br />
          5.1. Продавець має право:
          <br />
          <ul>
            <li>
              {' '}
              в односторонньому порядку припинити надання послуг за цим
              договором у разі порушення Покупцем умов цього договору.
            </li>
          </ul>
          5.2 Покупець зобов'язаний:
          <ul>
            <li> своєчасно оплатити замовлення на умовах цього договору.</li>
          </ul>
          5.3 Покупець має право:
          <ul>
            <li>оформити замовлення в Інтернет-магазині;</li>
            <li>оформити електронний договір;</li>
            <li>вимагати від Продавця виконання умов цього Договору.</li>
          </ul>
          <b>6. Відповідальність сторін</b>
          <br />
          6.1. Сторони несуть відповідальність за невиконання або неналежне
          виконання умов цього договору в порядку, передбаченому цим договором
          та чинним законодавством України.
          <br />
          6.2. Продавець не несе відповідальності за:
          <ul>
            <li>
              за зміст і правдивість інформації, наданої Покупцем при оформленні
              замовлення;
            </li>
            <li>
              за затримку і перебої в наданні Послуг (обробки замовлення), які
              відбуваються з причин, що знаходяться поза сферою його контролю;
            </li>
            <li>
              за протиправні незаконні дії, здійснені Покупцем за допомогою
              даного доступу до мережі Інтернет;
            </li>
            <li>
              за передачу Покупцем своїх мережевих ідентифікаторів - IP,
              MAC-адреси, логіна і пароля третім особам.
            </li>
          </ul>
          6.3. Покупець, використовуючи наданий йому доступ до мережі Інтернет,
          самостійно несе відповідальність за шкоду, заподіяну його діями
          (особисто, навіть якщо під його логіном знаходилося іншу особу) особам
          або їх майну, юридичним особам, державі чи моральним принципам
          моральності.
          <br />
          6.4. У разі настання обставин непереборної сили, сторони звільняються
          від виконання умов цього договору. Під обставинами непереборної сили
          для цілей цього договору розуміються події, що мають надзвичайний,
          непередбачений характер, які виключають або об'єктивно заважають
          виконанню цього договору, настання яких Сторони не могли передбачити і
          запобігти розумними способами.
          <br />
          6.5. Сторони прикладають максимум зусиль для вирішення будь-яких
          розбіжностей виключно шляхом переговорів.
          <br />
          <b>7. Інші умови</b>
          <br />
          7.1. Інтернет-магазин залишає за собою право в односторонньому порядку
          вносити зміни до цього договору за умови попередньої публікації його
          на сайті{' '}
          <a href="https://playcraft.com.ua"> https://playcraft.com.ua</a>
          <br />
          7.2. Інтернет-магазин створений для організації дистанційного способу
          придбання послуг через Інтернет.
          <br />
          7.3. Покупець несе відповідальність за достовірність інформації,
          зазначеної при оформленні замовлення інформації. При цьому, при
          здійсненні акцепту (оформленні замовлення і подальшої оплати товару)
          Покупець надає Продавцю свою беззастережну згоду на збір, обробку,
          зберігання, використання своїх персональних даних, в розумінні ЗУ «Про
          захист персональних даних».
          <br />
          7.4. Оплата Покупцем оформленого в Інтернет-магазині замовлення
          означає повну згоду Покупця з умовами договору купівлі-продажу
          (публічної оферти)
          <br />
          7.5. Фактичною датою електронного угоди між сторонами є дата прийняття
          умов, відповідно до ст. 11 Закону України «Про електронну комерцію»
          <br />
          7.6. Використання ресурсу Інтернет-магазину для попереднього перегляду
          товару, а також для оформлення замовлення для Покупця є безкоштовним.
          <br />
          7.7. Інформація, яка надана Покупцем є конфіденційною.
          Інтернет-магазин використовує інформацію про Покупця виключно в цілях
          обробки замовлення, відправлення повідомлень Покупцеві, доставки
          товару, здійснення взаєморозрахунків і ін.
          <br />
          <b>8. Порядок повернення товару належної якості</b>
          <br />
          8.1. Повернення товару в Інтернет-магазин проводиться згідно чинного
          законодавства України.
          <br />
          8.2. Повернення товару в Інтернет-магазин проводиться за рахунок
          Покупця.
          <br />
          8.3. При поверненні Покупцем товару належної якості, Інтернет-магазин
          повертає йому сплачену за товар грошову суму за фактом повернення
          товару за вирахуванням компенсації витрат Інтернет-магазину.
          <br />
          <b>9. Термін дії договору</b>
          <br />
          9.1. Електронний договір вважається укладеним з моменту одержання
          особою яка направила пропозицію укласти такий договір, відповіді про
          прийняття цієї пропозиції в порядку, визначеному частиною шостою
          статті 11 Закону України "Про електронну комерцію".
          <br />
          9.2. Сторони мають право розірвати цей договір в односторонньому
          порядку, в разі невиконання однією із сторін умов цього Договору та у
          випадках передбачених чинним законодавством України.
        </div>
      </div>{' '}
    </div>
  </section>
)
