import './Rules.scss'

export const Rules = () => {
  return (
    <section>
      <div className="section-outer">
        <div className="section-inner">
          <div className="rules content">
            <h2>Правила</h2>
            <br />
            <h4>1. Загальні положення.</h4>
            <ul>
              <li>
                1.1. Будь-яка дія адміністратора не потребує пояснення та
                доведення. Адміністрація робить все задля блага сервера і чесних
                гравців.
              </li>
              <li>
                1.2. Незнання цих правил не звільняє Вас від відповідальності.
              </li>
              <li>
                1.3. Гравець має право поскаржитися на модератора (вартового і
                т.д.), якщо він перевищує свої повноваження.
              </li>
              <li>
                1.4. Прямий обов’язок модератора — стежити за порядком на
                сервері. Адміністрація не зобов’язана виконувати забаганки
                гравців, як-от телепортація гравця куди подалі, видача ресурсів
                та інші. Повторні прохання після явної відмови адміністраторів
                прирівнюються до флуду/спаму і караються відповідно.
              </li>
              <li>
                1.5. Гравець має право поскаржитися на іншого гравця, якщо він
                порушує правила, за наявності доказів (фото, відео).
              </li>
              <li>
                1.6. За спробу обманути або обійти системи захисту сервера —
                бан.
              </li>
              <li>
                1.7. Ввійшовши на наш сервер, Ви тим самим підтверджуєте свою
                згоду з правилами.
              </li>
              <li>
                1.8. Ми залишаємо за собою право на видалення неактивних
                акаунтів, у випадку, якщо останній вхід у гру відбувався більше
                ніж 2 роки тому.
              </li>
            </ul>

            <h4>2. Будівлі, споруди, ландшафт.</h4>
            <ul>
              <li>
                2.1. ЗАБОРОНЕНО гріферити, псувати майно, красти речі та усіляко
                шкодити іншим гравцям, засмічувати місцевість, заливати водою та
                лавою тощо. Також заборонено псувати споруди, які мають будь-яку
                практичну цінність: доріжки, облаштовані залізничні рейки, місця
                для проходу, декоративні елементи, мости . Покаранням є бан.
                Завжди приватьте територію, щоб уникнути таких ситуацій.
              </li>
              <li>
                2.2. Заборонені привати, які обмежують пересування інших
                гравців. Блокування порталу в Ендер-світ також вважається
                порушенням.
              </li>
              <li>
                2.3. Якщо Ви долучили гравця до свого регіону, він автоматично
                стає його співвласником. Претензії про знищені чи перебудовані
                будівлі, а також „крадіжки“ речей у цьому випадку не
                приймаються.
              </li>
              <li>
                2.4. Забороняються споруди, які не мають сенсу будівель.
                Наприклад такі, як стовпи в небо, ями, повітряні платформи,
                пастки, мости без підпорів.
              </li>
              <li>
                2.5. Адміністрація не несе відповідальності за незапривачені
                споруди.
                <b>Головне правило — спочатку приватьте, а потім будуйте</b>!
              </li>
              <li>
                2.6. Прохання до адміністрації видалити чужу привачену територію
                може бути виконане тільки при наданні доказів її непотрібності.
                Нав’язливі прохання після відмови прирівнюються до флуду і
                жебракування. Ви можете дізнатися нікнейм гравця привату (/rg
                info) і тоді зв’язатись з адміністрацією, для перевірки, скільки
                часу людина не грає на сервері.
              </li>
              <li>
                2.7. Заборонені споруди, які містять образи (написи), а також
                пропаганду міжнаціональної, расової чи релігійної ворожнечі.
              </li>
              <li>
                2.8. Заборонено будувати автоматичні ферми які створюють велике
                навантаження на сервер. Це дуже субєктивне правило тому будуйте
                красиві споруди а не ферми. Ресурси з типових ферм можна
                придбати в /donate або на /spawn
              </li>
            </ul>
            <h4>3. Спілкування та взаємодія гравців.</h4>
            <ul>
              <li>
                <span className="agressive">
                  3.1. На серверах проєкту PlayCraft дозволено спілкуватись
                  виключно УКРАЇНСЬКОЮ мовою. У світлі подій останніх місяців
                  вважаємо недоречним спілкування на сервері мовою агресора,
                  мовою істот які прийшли вбивати та захоплювати. Будь-яке
                  навмисне використання мови агресора буде прирівнюватись до
                  нецензурної лайки. Наш проєкт створений для українців
                  українською. Граючи ви автоматично погоджуєтесь з даним
                  правилом. Якщо вам комфортніше вашою мовою для цього є
                  приватні повідомлення та голосові канали. Якщо ні - є понад 10
                  тисяч інших серверів. Дякуємо.
                </span>
              </li>
              <li>
                3.2. Флуд та капс заборонений (попередження, мют) . До флуду
                також прирівнюються повідомлення, які не несуть ніякого змісту
                або ті, які неможливо прочитати.
              </li>
              <li>
                3.3. Образа гравців чи адміністрації заборонена. Те ж саме для
                негативних висловлювань на адресу сервера в цілому. Для відгуків
                існує група (мют або бан).
              </li>
              <li>
                3.4. Заборонена провокація міжнаціональної, расової чи
                релігійної ворожнечі, приниження людської гідності тощо.
                Покаранням є мют на термін, починаючи від декількох днів.
              </li>
              <li>
                3.5. Заборонені нiки, які містять образи, ненормативну лексику,
                а також пропаганду міжнаціональної, расової чи релігійної
                ворожнечі. Комбінація цифр типу 1488 входить в цей список.
              </li>
              <li>
                3.6. Заборонена лайка у будь-якому вигляді, навіть транслітом чи
                на інших мовах. Завуальована лайка, а також лайка на табличках
                входять у це число.
              </li>
              <li>
                3.7. Заборонено вбивати гравців (пастками, підпалювати тощо)
                поза межами PvP-арен.
              </li>
              <li>
                3.8. Заборонено видавати себе за учасників команд
                адміністраторів та хелперів.
              </li>
            </ul>

            <h4>4. Інше.</h4>
            <ul>
              <li>
                4.1. Мультиакаунт заборонений. Будь ласка, попереджайте
                адміністрацію заздалегідь, якщо Ваші родичі, друзі чи знайомі
                мають можливість на постійній основі грати лише з того ж
                комп'ютера, що і Ви.
              </li>
              <li>
                4.2. За випрошування прав, предметів, телепорту, розбану і
                різних послуг на халяву у адміністрації — бан. Нам не потрібні
                жебраки.
              </li>
              <li>
                4.3. Втрачені речі та моби не повертаються! Якщо Ви втратили
                придбану річ на PvP-полі бою, в шахтах від вибуху крипера,
                потрапивши у лавову ванну в Пеклі, або ж навіть випадково
                викинули і не змогли підняти, то ця річ буде втраченою назавжди!
                В зв’язку з цим ще раз застерігаємо, будьте уважними!
              </li>
              <li>
                4.4. Заборонено використання/розповсюдження багів, дюпів і
                обману гри, сторонніх програм, прозорих текстур. Приховування
                баґів від адміністрації суворо карається. Якщо ви знайшли баг —
                повідомте адміністрацію. Всі дозволені аддони встановлені на
                клієнті.
              </li>
              <li>
                4.4.1. За вказування адміністрації на баґоюзера чи на самий баґ
                з доказами гравець винагороджується матеріально (розмір
                винагороди на розсуд адміністратора).
              </li>
              <li>
                4.5. Не можна блокувати виходи з порталу. Якщо ви створили
                захисні стіни навколо порталу, то залиште вільний вихід для
                гравців. В іншому разі — бан.
              </li>
              <li>
                4.6. Ніколи, за жодних обставин, нікому не кажіть свій пароль.
                Якщо ж ваш пароль вже хтось знає — швиденько зайдіть на сайт у
                розділ особистого кабінету та змініть його. При бані відмовки
                “та це був мій брат” чи “мій пароль знав мій друг, вибачте” вам
                НЕ ДОПОМОЖУТЬ.
              </li>
              <li>
                4.7. Заборонено використовувати повідомлення в прапорцях
                (greeting, farewell), що вводить гравців у оману (повідомлення
                від імені інших гравців) або має образливий вміст.
              </li>
            </ul>

            <h4>Тлумачення термінів:</h4>
            <ul>
              <li>
                <b>Бан</b> - заборона входу на сервер, обмеження в можливостях
                гравця. Бан може бути постійним або тимчасовим.
              </li>
              <li>
                <b>Баґ</b> - помилка, або дефект в системі, що викликає
                неправильні дії.
              </li>
              <li>
                <b>Мут, м’ют</b> (мовчанка) - заборона писати в ігровий чат.
                Вмикається хелперами за провини передбачені цими правилами.
              </li>
              <li>
                <b>Ґріферство, ґріф</b> - навмисне руйнування чужих та
                суспільних споруд, встановлення блоків, які шкодять іншим,
                заливання рідинами нейтральний, чужий простір, будь-яка
                діяльність, що обурює інших гравців.
              </li>
              <li>
                <b>Нік, нікнейм</b> - від англійської «nickname» - ім'я гравця,
                прізвисько, псевдонім
              </li>
              <li>
                <b>Мультиаккаунт</b> - утримування однією людиною більш ніж
                одного ігрового аккаунту.
              </li>
            </ul>
            <p className="last-change">Останні зміни в правилах: 22.10.2022</p>
          </div>
        </div>
      </div>
    </section>
  )
}
